In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
fl=pd.read_csv("keralafloods.csv")

In [4]:
fl.head()

,Cities,year,may,june,july,temperature,altitude,avg,label
0,ALAPPUZHA,2001,298.70,177.90,177.90,24,390,218.166667,1
1,ALAPPUZHA,2003,118.60,118.60,59.30,21,390,98.833333,0
2,ALAPPUZHA,2000,89.61,89.61,59.74,23,390,79.653333,0
3,ANGUL,2001,55.40,61.74,61.74,21,276,59.626667,0
4,ANGUL,2003,41.16,41.16,20.58,25,276,34.300000,0

In [5]:
fl.fillna(0)

,Cities,year,may,june,july,temperature,altitude,avg,label
0,ALAPPUZHA,2001,298.70,177.90,177.90,24,390,218.166667,1
1,ALAPPUZHA,2003,118.60,118.60,59.30,21,390,98.833333,0
2,ALAPPUZHA,2000,89.61,89.61,59.74,23,390,79.653333,0
3,ANGUL,2001,55.40,61.74,61.74,21,276,59.626667,0
4,ANGUL,2003,41.16,41.16,20.58,25,276,34.300000,0
...,...,...,...,...,...,...,...,...,...
127,THRISSUR,2003,141.48,141.48,70.74,26,341,117.900000,0
128,THRISSUR,2000,86.73,86.73,57.82,25,341,77.093333,0
129,WAYANAD,2003,698.10,333.12,333.12,27,214,454.780000,1
130,WAYANAD,2001,139.62,139.62,69.81,29,214,116.350000,0
131,WAYANAD,2000,52.38,52.38,34.92,27,214,46.560000,0

In [29]:
x=eq.iloc[:,2:8].values
y=eq.iloc[:,-1].values

In [30]:
#print(x)
print(y)

[1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 0 0 0 1 1 0 0
 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 0 0 0 1 0
 0 0 0 0 1 1 0 1 0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0 1 0 0]

In [31]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [66]:
from sklearn.linear_model import LinearRegression
regg=LinearRegression()
regg.fit(x_train,y_train)

LinearRegression()

In [67]:
print(regg.intercept_)

-0.17137529537791296

In [68]:
print(regg.coef_)

[-1.28828634e+06 -1.28828633e+06 -1.28828633e+06  6.94178905e-04
 -5.32631712e-05  3.86485901e+06]

In [69]:
print("Mean squared error: %.2f" % np.mean((regg.predict(x_test) - y_test) ** 2))
print('Variance score: %.2f' % regg.score(x_test, y_test))
r2_score = regg.score(x_test,y_test)
print(r2_score)

Mean squared error: 0.03
Variance score: 0.68
0.681721343801929

In [70]:
para=[[118.60,10.60,59.30,21,390,98.833333]]

In [73]:
predfl=regg.predict(para)
print(predfl)

[1.39134923e+08]

In [74]:
if(predfl >0):
    print("floods")
else:
    print("no floods")

floods